Repository: Homebrew/BrewUI
Catalog: Sources/BrewFeatureDoctor/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Some directories in the Caskroom do not have valid metadata.
zh_hans: Caskroom 中部分目录缺少有效的元数据。

source: The following cask cannot be upgraded as-is:
zh_hans: 以下应用程序目前无法直接升级：

source: The following casks cannot be upgraded as-is:
zh_hans: 以下应用程序目前无法直接升级：

source: %@, Fix available
zh_hans: %@，可修复

source: Copy brew doctor output
zh_hans: 复制 brew 诊断输出

source: Copy output
zh_hans: 复制输出

source: Danger
zh_hans: 严重问题

source: Doctor
zh_hans: 诊断

source: Doctor issues
zh_hans: 诊断问题

source: Fix available
zh_hans: 可修复

source: Last checked
zh_hans: 上次检查

source: Needs admin · runs in Terminal
zh_hans: 需要管理员权限 · 在终端中运行

source: No problems found
zh_hans: 未发现问题

source: No selection
zh_hans: 未选择项目

source: Raw output
zh_hans: 原始输出

source: Re-checking
zh_hans: 正在重新检查

source: Re-checking…
zh_hans: 正在重新检查…

source: Run Again
zh_hans: 重新运行

source: Run Fix
zh_hans: 执行修复

source: Run diagnostics, then choose an issue to see details and fixes.
zh_hans: 运行诊断后，选择问题以查看详情和修复方法。

source: Running brew doctor…
zh_hans: 正在运行 brew 诊断…

source: Severity: %@
zh_hans: 严重程度：%@

source: The check could not be completed
zh_hans: 无法完成检查

source: Unsupported
zh_hans: 不受支持

source: Warning
zh_hans: 警告

source: Warnings found
zh_hans: 发现警告

source: Your system is ready to brew
zh_hans: 系统已准备就绪

source: brew doctor found no problems.
zh_hans: brew 诊断未发现问题。

source: Please note that these warnings are just used to help the Homebrew maintainers with debugging if you file an issue. If everything you use Homebrew for is working fine: please don't worry or file an issue; just ignore this. Thanks!
zh_hans: 这些警告用于帮助 Homebrew 维护者排查你提交的问题。如果你使用 Homebrew 时一切正常，可以忽略这些提示，无需担心或提交问题。谢谢！

source: Some installed formulae are deprecated or disabled.
zh_hans: 部分已安装的命令行工具已弃用或被禁用。

source: Some installed formulae are deprecated.
zh_hans: 部分已安装的命令行工具已弃用。

source: Some installed casks are deprecated or disabled.
zh_hans: 部分已安装的应用程序已弃用或被禁用。

source: You should find replacements for the following formulae:
zh_hans: 请为以下命令行工具寻找替代项：

source: You should find replacements for the following casks:
zh_hans: 请为以下应用程序寻找替代项：

source: You have unlinked kegs in your Cellar.
zh_hans: Cellar 中有尚未链接的软件包。

source: Leaving kegs unlinked can lead to build-trouble and cause formulae that depend on those kegs to fail to run properly once built.
zh_hans: 未链接的软件包可能导致构建问题，并使依赖它们的命令行工具在构建后无法正常运行。

source: Run `brew link` on these:
zh_hans: 对以下软件包运行 `brew link`：

source: You can solve this by running:
zh_hans: 可以运行以下命令解决此问题：

source: To fix, run:
zh_hans: 请运行以下命令修复：

source: To fix this, run:
zh_hans: 请运行以下命令修复：

source: Affects:
zh_hans: 受影响的项目：

source: More information:
zh_hans: 更多信息：

source: Your Command Line Tools are too outdated.
zh_hans: 命令行工具版本过旧。

source: Your Command Line Tools are outdated.
zh_hans: 命令行工具已过时。

source: Your Xcode is outdated.
zh_hans: Xcode 已过时。

source: Update them from Software Update in System Settings.
zh_hans: 请在系统设置的“软件更新”中更新。

source: Update them from Software Update in System Preferences.
zh_hans: 请在系统偏好设置的“软件更新”中更新。

source: If that doesn't show you any updates, run:
zh_hans: 如果没有显示可用更新，请运行：

source: Alternatively, manually download them from:
zh_hans: 也可以从以下地址手动下载：

source: The following directories are not writable by your user:
zh_hans: 当前用户没有以下目录的写入权限：

source: The following directories do not exist:
zh_hans: 以下目录不存在：

source: You should create these directories and change their ownership to your user.
zh_hans: 请创建这些目录，并将其所有者改为当前用户。

source: You should change the ownership of these directories to your user, and make sure that you have write permission.
zh_hans: 请将这些目录的所有者改为当前用户，并确保你拥有写入权限。

source: And make sure that your user has write permission.
zh_hans: 并确保当前用户拥有写入权限。

source: The following tools exist at both paths:
zh_hans: 以下工具同时存在于这两个路径中：

source: Broken symlinks were found:
zh_hans: 发现失效的符号链接：

source: Broken symlinks were found. Remove them with `brew cleanup`:
zh_hans: 发现失效的符号链接。请使用 `brew cleanup` 清理：

source: Remove them with `brew cleanup`
zh_hans: 请使用 `brew cleanup` 清理

source: Remove them with `brew cleanup`:
zh_hans: 请使用 `brew cleanup` 清理：

source: Uncommitted git changes.
zh_hans: 存在尚未提交的 Git 更改。

source: Your homebrew git repo has uncommitted changes.
zh_hans: Homebrew 的 Git 仓库存在尚未提交的更改。

source: Uncommitted files:
zh_hans: 尚未提交的文件：

source: Homebrew's bin was not found in your PATH.
zh_hans: PATH 中未找到 Homebrew 的 bin 目录。

source: Homebrew's "bin" was not found in your PATH.
zh_hans: PATH 中未找到 Homebrew 的 bin 目录。

source: Homebrew's origin is not set.
zh_hans: Homebrew 尚未设置 origin 远程仓库。

source: Consider setting your PATH for example like so:
zh_hans: 可以参考以下示例设置 PATH：

source: Another `brew` shadows this Homebrew installation in your PATH:
zh_hans: PATH 中的另一个 `brew` 优先于当前 Homebrew 安装：

source: This may be a helper, wrapper or another Homebrew installation.
zh_hans: 它可能是辅助程序、包装脚本或另一个 Homebrew 安装。

source: This means that system-provided programs will be used instead of those provided by Homebrew.
zh_hans: 这意味着系统提供的程序会优先于 Homebrew 提供的程序运行。

source: Your Cellar is symlinked.
zh_hans: Cellar 是一个符号链接。

source: Symlinked Cellars can cause problems.
zh_hans: 通过符号链接访问 Cellar 可能引发问题。

source: Some installed formulae or casks are missing dependencies.
zh_hans: 部分已安装的命令行工具或应用程序缺少依赖项。

source: Run `brew missing` for more details.
zh_hans: 运行 `brew missing` 查看详情。

source: Some of Homebrew's bottles (binary packages) cannot be used with this prefix.
zh_hans: 此安装路径无法使用部分 Homebrew 预编译软件包。

source: The detected git configuration values are:
zh_hans: 检测到的 Git 配置值如下：

source: Update guidance:
zh_hans: 更新指引：

source: This is a Tier 2 configuration:
zh_hans: 这是二级支持配置：

source: This is a Tier 3 configuration:
zh_hans: 这是三级支持配置：

source: This is an unsupported configuration.
zh_hans: 此配置不受支持。

source: This is an Unsupported configuration:
zh_hans: 此配置不受支持：

source: Unsupported configuration:
zh_hans: 不受支持的配置：

source: To set it, run the following command:
zh_hans: 请运行以下命令进行设置：
